src/cf/src/Catalogs/Справочник2/Справочник2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Справочник2</name>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГуидСпр1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/ФоновыеЗаданияТест/Module.bsl
Процедура ВыгрузитьДанные() Экспорт
	
	Каталог = Константы.Каталог.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка.Наименование КАК Наименование,
		|	Справочник1.Реквизит1 КАК Реквизит1,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Справочник1.Ссылка) КАК Гуид
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1";
	
	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	
	ТекДатаСтрока = Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
	
	ФайлJSON = СтрШаблон("%1%2.json", Каталог, ТекДатаСтрока);
    ЗаписьФайла = Новый ЗаписьJSON;
    ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
    ЗаписьФайла.ОткрытьФайл(ФайлJSON,,,ПараметрыЗаписи);
	
	ЗаписьФайла.ЗаписатьНачалоМассива();	
	Для Каждого Элем Из РезультатТЗ Цикл
	    ЗаписьФайла.ЗаписатьНачалоОбъекта();
		Для Каждого ЭлемКолонка Из РезультатТЗ.Колонки Цикл
	    	ЗаписьФайла.ЗаписатьИмяСвойства(ЭлемКолонка.Имя);
	    	ЗаписьФайла.ЗаписатьЗначение(Строка(Элем[ЭлемКолонка.Имя]));
		КонецЦикла;
	    ЗаписьФайла.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьФайла.ЗаписатьКонецМассива();
	
	ЗаписьФайла.Закрыть();
	
КонецПроцедуры   

Процедура ЗагрузитьДанные() Экспорт
	Каталог = Константы.Каталог.Получить();
	
	ТекДатаСтрока = Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
	ФайлJSON = СтрШаблон("%1%2.json", Каталог, ТекДатаСтрока);
	Чтение = Новый ЧтениеJSON;
    Чтение.ОткрытьФайл(ФайлJSON);
    Данные = ПрочитатьJSON(Чтение, Ложь);
	
	Для Каждого Элем Из Данные Цикл
		НайденныйЭлемент = Справочники.Справочник2.НайтиПоРеквизиту("ГуидСпр1", Элем.Гуид);
		Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			ИзменяемыйОбъект = НайденныйЭлемент.ПолучитьОбъект();
			ИзменяемыйОбъект.ОбменДанными.Загрузка = Истина;
			ИзменяемыйОбъект.Наименование = Элем.Наименование;
			ИзменяемыйОбъект.Реквизит1 = Элем.Реквизит1;
			ИзменяемыйОбъект.Записать();
		Иначе
			СоздаваемыйОбъект = Справочники.Справочник2.СоздатьЭлемент();  
			СоздаваемыйОбъект.Наименование = Элем.Наименование;
			СоздаваемыйОбъект.Реквизит1 = Элем.Реквизит1;
			СоздаваемыйОбъект.ГуидСпр1 = Элем.Гуид;
			СоздаваемыйОбъект.Записать();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
